Repository: huixiangyang/arc-kit
Catalog: Sources/Application/Resources/Localization/Overview.xcstrings
Source language: en
Languages: zh_hans

# action.re.registers.arcKit.extension
source: Re-registers the Arc Kit extension and restarts Finder. Active Finder operations may be interrupted.
zh_hans: 会重新注册 Arc Kit 扩展并重启 Finder。正在进行的 Finder 操作可能中断。

# action.repair.finder.extension.registration
source: Repair Finder extension registration?
zh_hans: 修复 Finder 扩展注册？

# action.repair.restart.finder
source: Repair and Restart Finder
zh_hans: 修复并重启 Finder

# health.accessibility.required
source: Accessibility permission required
zh_hans: 需要辅助功能权限

# health.allow.monitoring
source: Allow Monitoring
zh_hans: 允许监听

# health.background.instance.issue
source: Background instance issue
zh_hans: 后台实例异常

# health.background.registration.notReady
source: Background registration not ready
zh_hans: 后台注册未就绪

# health.background.service.disconnected
source: Background service disconnected
zh_hans: 后台未连接

# health.check.again.required
source: Check again required
zh_hans: 需要重新检测

# health.check.again.retry.registration.if
source: Check again to retry registration. If it keeps failing, view technical details.
zh_hans: 重新检测以重试后台注册；持续失败时查看技术详情

# health.check.background.permission.macos.login.items
source: Check background permission in macOS Login Items
zh_hans: 检查 macOS 登录项中的后台许可

# health.check.unregistered.items.conflicts
source: Check unregistered items or conflicts on the Shortcuts page
zh_hans: 在快捷键页查看未注册项目或冲突

# health.checking
source: Checking
zh_hans: 检测中

# health.connection.ready
source: Connection ready
zh_hans: 连接就绪

# health.current.valid.result.missing
source: No current valid result
zh_hans: 尚无当前有效的检测结果

# health.debugDisconnected
source: Debug window is not connected to the background service
zh_hans: 调试窗口未连接后台

# health.duplicateInstallationHint
source: Duplicate processes or another installation detected. Check paths in diagnostics.
zh_hans: 存在重复进程或其他安装副本；在诊断中核对路径

# health.eligible.apps.missing
source: No eligible apps
zh_hans: 没有生效应用

# health.enable.arcKit.macos.extension.settings
source: Enable Arc Kit in macOS extension settings
zh_hans: 在 macOS 扩展设置中开启 Arc Kit

# health.enabled.demand
source: Enabled on demand
zh_hans: 按需启用

# health.enabled.menu.configuration.detected.yet.missing
source: No enabled menu configuration detected yet
zh_hans: 尚未检测到已启用的菜单配置

# health.extension.off
source: Extension is off
zh_hans: 扩展未开启

# health.extension.registration.issue
source: Extension registration issue
zh_hans: 扩展注册异常

# health.extension.responded.background.starts.demand
source: Extension responded; background starts on demand
zh_hans: 扩展已回应，后台按需启动

# health.extension.responded.verify.actual.menus.actions
source: Extension responded. Verify actual menus and actions in Finder.
zh_hans: 扩展已回应；实际菜单与操作需在 Finder 中确认

# health.extension.settings
source: Extension Settings
zh_hans: 扩展设置

# health.finder.diagnostic.results.yet.missing
source: No Finder diagnostic results yet
zh_hans: 尚未取得 Finder 检测结果

# health.grant.access.arcKit.host
source: Grant access to: Arc Kit Runtime Host
zh_hans: 授权对象：Arc Kit Runtime Host

# health.incomplete.installation
source: Incomplete installation
zh_hans: 安装不完整

# health.last.check.expired
source: The last check has expired
zh_hans: 上次检测结果已过期

# health.menu.configuration.notReady
source: Menu configuration not ready
zh_hans: 菜单配置未就绪

# health.monitoring
source: Monitoring
zh_hans: 监听中

# health.monitoring.started.confirm.scrolling.behavior.use
source: Monitoring started. Confirm scrolling behavior in use.
zh_hans: 监听已启动；滚动效果需实际确认

# health.mouse.service.error
source: Mouse service error
zh_hans: 鼠标运行异常

# health.open.included.folder.check.again
source: Open an included folder, then check again. No response does not imply missing permission.
zh_hans: 打开生效目录后重新检测；未回应不等于未授权

# health.permission.granted.window.interface.check
source: Permission granted, but the window interface check failed. Check again first.
zh_hans: 已获授权，但窗口接口检测未通过；先重新检测

# health.permissionsUnconfirmed
source: Unable to read background status; permissions unconfirmed
zh_hans: 无法读取后台状态，权限尚未确认

# health.registration.path.missing.points
source: Registration path is missing or points to another installation
zh_hans: 注册路径缺失或指向其他安装副本

# health.repair.registration
source: Repair Registration…
zh_hans: 修复注册…

# health.request.access
source: Request Access
zh_hans: 申请授权

# health.runtime.components.missing.damaged.reinstall
source: Runtime components are missing or damaged. Reinstall Arc Kit.
zh_hans: 缺少或损坏运行组件，需要重新安装

# health.scope.limited.selected.apps
source: Scope is limited to selected apps, but no app rules are enabled
zh_hans: 当前仅对指定应用生效，但尚未启用任何应用规则

# health.service.notReady
source: Service not ready
zh_hans: 服务未就绪

# health.service.ready
source: Service ready
zh_hans: 服务就绪

# health.serviceUnavailable
source: Permission granted, but the service is not running yet
zh_hans: 权限已授权，服务尚未进入运行状态

# health.snapping.notReady
source: Drag snapping not ready
zh_hans: 拖拽吸附未就绪

# health.some.shortcuts.unavailable
source: Some shortcuts unavailable
zh_hans: 快捷键部分不可用

# health.starting
source: Starting
zh_hans: 正在启动

# health.view.settings
source: View Settings
zh_hans: 查看设置

# health.waiting.background.response
source: Waiting for background response
zh_hans: 等待后台回应

# health.waiting.finder
source: Waiting for Finder
zh_hans: 等待 Finder 回应

# health.window.interface.available.drag.monitoring
source: Window interface is available, but drag monitoring has not started
zh_hans: 窗口接口可用，拖拽监听尚未启动

# health.window.interface.enabled.monitors.passed.checks
source: Window interface and enabled monitors passed checks
zh_hans: 窗口接口及已启用的监听检查通过

# health.window.interface.unavailable
source: Window interface unavailable
zh_hans: 窗口接口不可用

# page.accessibility
source: Accessibility
zh_hans: 辅助功能

# page.background.execution
source: Background execution
zh_hans: 后台运行

# page.checked
source: Checked at %1$@
zh_hans: 检测于 %1$@

# page.checking
source: Checking…
zh_hans: 检测中…

# page.creating.terminal.tabs.windows.running
source: Creating terminal tabs or windows and running chosen scripts request access when needed. File access failures are handled per folder; Full Disk Access is not required by default.
zh_hans: 终端新建标签或窗口、自选脚本按实际操作触发授权。文件访问失败按具体目录处理，不要求统一开启完全磁盘访问。

# page.debugScope
source: Debug: settings only, not connected to installed services
zh_hans: Debug：仅编辑设置，未连接安装版服务

# page.determined.macos.accessing.protected.locations
source: Determined by macOS when accessing protected locations
zh_hans: 访问受保护位置时由系统决定

# page.feature.status
source: Feature Status
zh_hans: 功能状态

# page.files.folders
source: Files and folders
zh_hans: 文件与文件夹

# page.finder.extension
source: Finder extension
zh_hans: Finder 扩展

# page.inputSamplesUnavailable
source: Background disconnected; no input samples available
zh_hans: 未连接后台，暂无输入采样

# page.manage.access
source: Manage Access
zh_hans: 管理授权

# page.permissions
source: Permissions
zh_hans: 权限

# page.requested.per.action
source: Requested per action
zh_hans: 按操作申请

# page.requested.per.target.app
source: Requested per target app
zh_hans: 按目标应用申请

# page.settings
source: Settings
zh_hans: 设置

# page.system.permissions
source: System Permissions
zh_hans: 系统授权

# page.terminal.automation
source: Terminal automation
zh_hans: 终端自动化
